
#include <locale.h>
#include <stdio.h>
int main(void) {
	setlocale(LC_ALL, "Rus");
	int n, a, b, c, b1;
	char s[][10] = {"Сто", "Двести", "Триста", "Четыреста" , "Пятьсот", "Шестьсот", "Семьсот", "Восемьсот", "Девятьсот" };
	char d[][15] = {"двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто" };
	char e[][15] = {"один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять" };
	char dop[][26] = { "десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать" };
	printf("Введите число\n");
	scanf_s("%i", &n);
	a = n / 100;
	b = n % 100;
	b1 = b;
	if ((b1 < 20) && (b1 > 9)) {
		b = b % 10;
		printf("%s %s", s[a-1], dop[b-2]);
		return 0;
	}
	else {
		b = (n % 100) / 10;
		c = n % 10;
		printf("%s %s %s", s[a-1], d[b-2], e[c-1]);
	}
	return 0;
}